{
    "day": 1,
    "topic": "Passive 1 (is done/was done) and Passive 2 (be done/been done/being done)",
    "sections": [
      {
        "title": "Introduction",
        "content": "Welcome to Units 42 and 43 of our English learning journey. In these units, we'll explore the passive voice, focusing on 'Passive 1' with 'is done' and 'was done,' and 'Passive 2' with 'be done,' 'been done,'' and 'being done."
      },
      {
        "title": "Definition",
        "content": "Understanding the passive voice is essential for effective communication. Let's delve into the key concepts."
      },
      {
        "title": "Passive 1",
        "content": "Passive 1 (is done/was done)",
        "points": [
          "Use 'is done' for present passive constructions and 'was done' for past passive constructions.",
          "The report is being written by the team",
          "The movie was watched by millions of people"
        ]
      },
      {
        "title": "Passive 2",
        "content": "Passive 2 (be done/been done/being done)",
        "points": [
          "Use 'be done' for general passive constructions, 'been done' for completed actions, and 'being done for actions in progress",
          "The document will be sent tomorrow",
          "The project has been completed ahead of schedule",
          "The house is being painted by the workers"
        ]
      },
      {
        "title": "Passive-1 and Passive-2",
        "content": "Let's examine examples to illustrate the application of Passive 1 and Passive 2",
        "points": [
          "The cake is baked by Mary every Sunday",
          "The novel was read by students during the summer break",
          "The new software is being developed by our team."
        ]
      },
      {
        "title": "Usage and Context",
        "content": "Understand the appropriate contexts for using Passive 1 and Passive 2, considering present, past, and continuous passive constructions."
      },
      {
        "title": "Recap and Summary:",
        "content": "In summary, understanding Passive 1 and Passive 2 is crucial for expressing actions without necessarily specifying the doer. Pay attention to verb forms and tenses."
      },
      {
        "title": "Additional Resources:",
        "content": "For additional practice and reinforcement, consider exploring examples in language learning books and online exercises."
      },
      {
        "title": "Conclusion",
        "content": "Thank you for joining today's lesson on 'Passive 1 and Passive 2.' Practice using passive constructions confidently in various situations, and feel free to reach out if you have any questions. Happy learning!"
      }
    ]
  }